IdeaRS.Connections
AnchoringDataHelper.ParseToAbsPos Method (String, Double, IFormatProvider)
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.String,System.Double,System.IFormatProvider)"]
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static List<double> ParseToAbsPos(
	string s,
	double scale,
	IFormatProvider provider = null
)
Parameters
s
Type: String
[Missing <param name="s"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.String,System.Double,System.IFormatProvider)"]
scale
Type: Double
[Missing <param name="scale"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.String,System.Double,System.IFormatProvider)"]
provider (Optional)
Type: IFormatProvider
[Missing <param name="provider"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.String,System.Double,System.IFormatProvider)"]
Return Value
Type: List<Double>
[Missing <returns> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.ParseToAbsPos(System.String,System.Double,System.IFormatProvider)"]
See Also
Reference
AnchoringDataHelper Class
ParseToAbsPos Overload
IdeaRS.Connections.Data Namespace